1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ум_СпособыОбработкиПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_СпособыОбработкиПакетов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МногопоточноеИзменениеПакетовДанных</name>
      <description>Многопоточное изменение пакетов данных</description>
    </items>
    <items>
      <name>ОчисткаЛоговФЗ</name>
      <description>Очистка логов ФЗ</description>
    </items>
    <items>
      <name>ПакетыДанныхОбслуживание</name>
      <description>Регламентное обслуживание пакетов данных</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниУправляющегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаУправляющееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниРабочегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаРабочееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторнаяОбработкаПакетовСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутПовторнойОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПакетПриУспешнойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутУдаленияПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщийСписокОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизвольныйКодОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаПроизвольногоКодаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиОбработкиПакетов</name>
    <attributes>
      <name>ОписаниеОшбики</name>
      <type>
        <types>CatalogRef.ум_ОписанияОшибокОбработкиПакетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1c_um/src/Enums/ум_СостоянияПакетаДанных/ум_СостоянияПакетаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_СостоянияПакетаДанных</name>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Модуль менеджера - Справочник.ум_СпособыОбработкиПакетов.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// ТУДУ пример плохой, не будет работать при запуске обработки пакета в сеансе пользователя (вызвать паузу - только ФЗ можно)      

Функция ТекстПримераПроизвольногоКода() Экспорт
	
	Результат = "//
	|// Доступные переменные контекста:
	|//		Данные						 - произвольный	- данные пакета данных.
	|//		ПараметрыПакетаДанных		 - структура	- структура, содержащая информацию о пакете данных.
	|//		ПараметрыСпособаОбработки	 - структура	- структура, содержащая параметры способа обработки на момент вызова процедуры обработки пакета.
	|// 
	|// Возвращаемое значение: необходимо вернуть структуру - ""РезультатОбработкиПакета"" с описанием статуса завершения обработки.
	|// 	СостояниеПакетаДанных:
	|//			Перечисления.ум_СостоянияПакетаДанных.Обработан - пакет успешно обработан
	|//			Перечисления.ум_СостоянияПакетаДанных.Ошибка	- ошибка обработки пакета
	|//			Перечисления.ум_СостоянияПакетаДанных.КОбработке- пакет в данной попытке успешно обработан не был, необходима повторная обработка пакета.
	|// 	Сообщение:
	|//			Произвольнный текст. В случае ошибки сюда необходимо вставить описание ошибки. Значение не обязательное.
	|// 	РезультатОбработки
	|//			Произвольный набор данных. Значение не обязательное.
	|
	|/////////////////////////////////////////////////////
	|// КОД ОБРАБОТКИ ПАКЕТА
	|
	|// Код, который выполняется долго - демонстратор работы пакетов.
	|ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	|ДлинаПаузы = ГСЧ.СлучайноеЧисло(5, 15);
	|ВызватьПаузу(ДлинаПаузы);
	|
	|// КОД ОБРАБОТКИ ПАКЕТА
	|//////////////////////////////////////////////////////
	|
	|РезультатОбработкиПакета = Новый Структура;
	|РезультатОбработкиПакета.Вставить(""СостояниеПакетаДанных""	, Перечисления.ум_СостоянияПакетаДанных.Обработан);
	|РезультатОбработкиПакета.Вставить(""Сообщение""				, ""Вызвали паузу "" + ДлинаПаузы + "" сек."");
	|РезультатОбработкиПакета.Вставить(""РезультатОбработки""		, Неопределено);		// произвольное значение, сохраняемое журнале событий пакетов данных
	|";
	
	Возврат Результат;
	
КонецФункции // ТекстПримераПроизвольногоКода()

Процедура ИнициализацияПредопределенныхЭлементовСпособовОбработкиПакетов() Экспорт
	
	//1. Обслуживание пакетов данных
	СпособОбработки = Справочники.ум_СпособыОбработкиПакетов.ПакетыДанныхОбслуживание;
	ИмяФункции = "ум_ПакетыДанныхОбслуживание.ПакетыДанныхОбслуживание_ОбработкаПакета";
	Параметры  = ПараметрыСпособаОбработкиПакетовПоУмолчанию();
	Параметры.Вставить("ИмяФункции", ИмяФункции);
	ЗаполнитьПараметрыСпособаОбработкиПакетов(СпособОбработки, Параметры);
	
	// 3. Многопоточное изменение пакетов данных
	СпособОбработки = Справочники.ум_СпособыОбработкиПакетов.МногопоточноеИзменениеПакетовДанных;
	ИмяФункции = "ум_ИзменениеПакетовДанных.ОбработчикПакетаДанных_ВыполнитьИзменениеПакетовДанных";
	Параметры  = ПараметрыСпособаОбработкиПакетовПоУмолчанию();
	Параметры.Вставить("ИмяФункции", ИмяФункции);
	ЗаполнитьПараметрыСпособаОбработкиПакетов(СпособОбработки, Параметры);
	
	// 4. Очистка логов ФЗ
	СпособОбработки = Справочники.ум_СпособыОбработкиПакетов.ОчисткаЛоговФЗ;
	ИмяФункции = "ум_ЛогированиеПакетыДанных.СпособОбработкиОчисткаЛоговФЗ";
	Параметры  = ПараметрыСпособаОбработкиПакетовПоУмолчанию();
	Параметры.Вставить("ИмяФункции", ИмяФункции);
	ЗаполнитьПараметрыСпособаОбработкиПакетов(СпособОбработки, Параметры);
	
КонецПроцедуры // ИнициализацияПредопределенныхЭлементовСпособовОбработкиПакетов()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыСпособаОбработкиПакетовПоУмолчанию()
	
	Результат = Новый Структура;
	Результат.Вставить("Активность", Истина);
	Результат.Вставить("КоличествоРабочихФЗ", 5);
	Результат.Вставить("КоличествоПакетовНаРабочееФЗ", 1);
	Результат.Вставить("КоличествоПопытокОбработкиПакета", 10);
	Результат.Вставить("ВремяЖизниУправляющегоФЗ", 60);
	Результат.Вставить("ТаймаутПовторнойОбработкиПакета", 120);
	Результат.Вставить("ПовторнаяОбработкаПакетовСОшибками", Истина);
	Результат.Вставить("УдалятьПакетПриУспешнойОбработке", Истина);
	Результат.Вставить("ТаймаутУдаленияПакета", 24);
	Результат.Вставить("ИспользоватьОбщийСписокОшибок", Истина);
	Результат.Вставить("КоличествоПакетовНаУправляющееФЗ", 0);
		
	Возврат Результат;
	
КонецФункции // ПараметрыСпособаОбработкиПакетовПоУмолчанию()

Процедура ЗаполнитьПараметрыСпособаОбработкиПакетов(СпособОбработки, Параметры)
	
	СпособОбъект = СпособОбработки.ПолучитьОбъект();
	Если СпособОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СпособОбъект, Параметры);
	СпособОбъект.Записать();
	
КонецПроцедуры // ЗаполнитьПараметрыСпособаОбработкиПакетов()

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
